app/controllers/posts_controller.rb

INSERT INTO "posts" ("parentPostId", "rootPostId", "commentPermissions", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def createNew
        Post.create!(new_post_params)