app/controllers/posts_controller.rb

    def getLatest
        uf = UserFollower.where(followerId: params[:id]).pluck(:user_id)
        uf.append(params[:id])
        posts = Post.where(user_id: uf, parentPostId: 0).order(created_at: :desc)
---
SELECT "user_followers"."user_id" FROM "user_followers" WHERE "user_followers"."followerId" = ?  [["followerId", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (?, ?, ?) AND "posts"."parentPostId" = ? ORDER BY "posts"."created_at" ASC, "desc" ASC  [["user_id", 2], ["user_id", 1], ["user_id", 4], ["parentPostId", "0"]]

    def showDetail
        posts = Post.where("rootPostId = ? OR id = ?", params[:id], params[:id]).order(:created_at)
---
SELECT "posts".* FROM "posts" WHERE "posts"."rootPostId" = ? ORDER BY "posts"."created_at" ASC  [["rootPostId", "[FILTERED]"]]

    def getUserPosts
        u = User.where(handle: params[:handle])
        pp u
        if (u)
            posts = Post.where(user_id: u.ids, parentPostId: 0).order(:created_at)
---
SELECT "users".* FROM "users" WHERE "users"."handle" = ?  [["handle", "ADMIN2"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."parentPostId" = ? ORDER BY "posts"."created_at" ASC  [["user_id", 2], ["parentPostId", "0"]]

    def createNew
        post = Post.create!(new_post_params)
---
INSERT INTO "posts" ("parentPostId", "rootPostId", "commentPermissions", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def createComment
        post = Post.create!(comment_params)
---
INSERT INTO "posts" ("parentPostId", "rootPostId", "commentPermissions", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        post = Post.find(params[:id])
        post.update!(new_post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 459], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "Lots of stuff"], ["updated_at", "2022-12-08 17:59:39.664984"], ["id", 459]]