app/controllers/user_followers_controller.rb

SELECT "user_followers".* FROM "user_followers" WHERE "user_followers"."user_id" = ? AND "user_followers"."followerId" = ?  [["user_id", 1], ["followerId", 1]]
INSERT INTO "user_followers" ("user_id", "followerId", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["followerId", 1], ["created_at", "2022-12-08 17:55:09.457313"], ["updated_at", "2022-12-08 17:55:09.457313"]]
---
    def addFollower
        uf = UserFollower.where(user_id: params[:userId], followerId: params[:followerId])
        if (uf.length > 0)
            render json: {}, status: 407
        else
            nuf = UserFollower.create(user_id: params[:userId], followerId: params[:followerId])