app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        # byebug
    user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "joe"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "handle", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Prince"], ["handle", "Prince"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-09 16:00:45.457112"], ["updated_at", "2022-12-09 16:00:45.457112"]]
---
    def createAccount
        user = User.find_by(name: params[:name])
        if (user)
            render json: {errors: "Name already exists"}, status: 401
        else
            u = User.save(name: params[:name], handle: params[:handle], password: params[:password])